---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditRenamedWorkset
source: html/49fdbc20-c4c4-1dc2-1145-33fdc08ba6f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditRenamedWorkset Property

Can't edit workset ' [Name] '.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotEditRenamedWorkset { get; }
```